Revit 2027 API
MEPSection.GetPressureDrop Method
 Gets the pressure drop for the specified element id in this section.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetPressureDrop(
	ElementId elemId
)
Public Function GetPressureDrop (
	elemId As ElementId
) As Double
public:
double GetPressureDrop(
	ElementId^ elemId
)
member GetPressureDrop :
        elemId : ElementId -> float
Parameters
elemId ElementId
 The element id which can be duct segment, duct fitting , pipe segment and pipe fitting.
Return Value
Double
Exceptions
Exception | Condition
ArgumentException |  The ElementId elemId does not correspond to a valid section member.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MEPSection Class
Autodesk.Revit.DB.Mechanical Namespace